# Домашнее задание 2 

Необходимо реализовать схему, указанную в hw_diagram.pdf

## Описание таблиц 
PeopleStatus - Описание возможных статусов людей, которые есть в университете (Студент, Преподаватель).
Faculties - Описание факультетов, которые есть в университете (KIB, IT, и т.д.).
People - Информация о людях в университете (Имя, почта, ссылка на факультет, ссылка на статус).
Classes - Описание возможных классов в университете (название (Математический анализ) и ссылка на факультет).
Semesters - Справочник семестров факультета(например, Осень2016, '2016-01-01', '2016-12-31').
ClassesSchedule - Расписание классов (ссылки на семестр, преподавателя и курс, день недели, время начала).
StudentsSchedule - Таблица, описывающая, какой студент ходит на какой курс.

In [31]:
%load_ext sql
%sql sqlite:///chinook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@chinook.db'

## Создание таблиц
Напишет ниже скрипты по созданию таблиц с учетом всех внешних ключей.

In [32]:
%%sql
DROP TABLE if exists PeopleStatus;
    CREATE TABLE  PeopleStatus(id INTEGER PRIMARY KEY, name VARCHAR);
DROP TABLE if exists People;
    CREATE TABLE People(id INTEGER PRIMARY KEY,name VARCHAR,email VARCHAR, fac_id INTEGER ,status_id INTEGER) ;
DROP TABLE if exists Faculties; 
    CREATE TABLE Faculties( id INTEGER PRIMARY KEY, name  VARCHAR); 
DROP TABLE if exists Classes; 
    CREATE TABLE Classes( id INTEGER PRIMARY KEY, description  VARCHAR, fac_id INTEGER); 
DROP TABLE if exists StudentsSchedule; 
    CREATE TABLE StudentsSchedule( student_id INTEGER PRIMARY KEY, studentsSchedule_id INTEGER ); 
DROP TABLE if exists ClassesSchedule; 
    CREATE TABLE ClassesSchedule( id INTEGER PRIMARY KEY, class_id INTEGER, teacher_id INTEGER, semestr_id INTEGER, week_day INTEGER, time_start  VARCHAR); 
DROP TABLE if exists Semesters; 
    CREATE TABLE Semesters( id INTEGER(0,0) NOT NULL PRIMARY KEY, shortname  VARCHAR, date_start date, date_end DATE(0,0) );

0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Добавление записей в таблицы
Приведите примеры добавления записей в каждую из таблиц

In [33]:
%%sql
insert into PeopleStatus values(1, 'Teacher'); 
insert into PeopleStatus values(2,'Student'); 
insert into PeopleStatus values(3, 'Provost'); 
insert into PeopleStatus values(4,'Rector');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Находится ли указанная схема ниже в BCNF? Напишите ниже функциональные зависимости, которые вы считаете, есть в указанной схеме.

In [34]:
%%sql
insert into People values(1,'John', 'abc.ru', 111, 10001); 
insert into People values(2,'Kate', 'def.ru', 222, 10002); 
insert into People values(3,'Alex', 'cska.ru', 333, 10003); 
insert into People values(4,'Mark', 'fkf.ru', 444, 10004);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [35]:
%%sql
insert into Faculties values(1,'KIB'); 
insert into Faculties values(2,'IT'); 
insert into Faculties values(3,'RTS'); 
insert into Faculties values(4,'EKONOMIKA');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql

insert into Classes values(1, 'A1', 111); 
insert into Classes values(2, 'A2', 222); 
insert into Classes values(3, 'A3', 333); 
insert into Classes values(4, 'A4', 444);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [37]:
%%sql

insert into ClassesSchedule values(1, 1, 1, 1, 1, '9:00'); 
insert into ClassesSchedule values(2, 2, 1, 3, 2, '10:30'); 
insert into ClassesSchedule values(3, 3, 3, 5, 3, '13:00'); 
insert into ClassesSchedule values(4, 4, 1, 2, 4, '15:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%%sql
insert into StudentsSchedule values(1, 'Jo1'); 
insert into StudentsSchedule values(2, 'Ka2'); 
insert into StudentsSchedule values(3, 'Al3'); 
insert into StudentsSchedule values(4, 'Ma4');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [39]:
%%sql
insert into Semesters values(1, 'AB', '2016-09-01', '2016-11-31'); 
insert into Semesters values(2, 'CD','2016-12-01', '2017-02-31'); 
insert into Semesters values(3, 'EF', '2017-03-01', '2017-05-31'); 
insert into Semesters values(4, 'GH','2017-06-01', '2017-08-31');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [40]:
%%sql
select *
from People

Done.

[(1, 'John', 'abc.ru', 111, 10001),
 (2, 'Kate', 'def.ru', 222, 10002),
 (3, 'Alex', 'cska.ru', 333, 10003),
 (4, 'Mark', 'fkf.ru', 444, 10004)]

In [41]:
%%sql
select * 
from Classes

Done.

[(1, 'A1', 111), (2, 'A2', 222), (3, 'A3', 333), (4, 'A4', 444)]

In [42]:
%%sql
select *   from Faculties

Done.

[(1, 'KIB'), (2, 'IT'), (3, 'RTS'), (4, 'EKONOMIKA')]

In [43]:
%%sql
select * from PeopleStatus

Done.

[(1, 'Teacher'), (2, 'Student'), (3, 'Provost'), (4, 'Rector')]

In [44]:
%%sql
select * from StudentsSchedule

Done.

[(1, 'Jo1'), (2, 'Ka2'), (3, 'Al3'), (4, 'Ma4')]

In [45]:
%%sql
select * from ClassesSchedule

Done.

[(1, 1, 1, 1, 1, '9:00'),
 (2, 2, 1, 3, 2, '10:30'),
 (3, 3, 3, 5, 3, '13:00'),
 (4, 4, 1, 2, 4, '15:00')]

In [46]:
%%sql
select * from Semesters

Done.

[(1, 'AB', '2016-09-01', '2016-11-31'),
 (2, 'CD', '2016-12-01', '2017-02-31'),
 (3, 'EF', '2017-03-01', '2017-05-31'),
 (4, 'GH', '2017-06-01', '2017-08-31')]